biddr-rails-api/app/controllers/api/v1/auctions_controller.rb

INSERT INTO "auctions" ("details", "reserve_price", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["details", "Beautiful shiny object that you really really want"], ["reserve_price", 12], ["created_at", "2018-11-26 17:45:16.985669"], ["updated_at", "2018-11-26 17:45:16.985669"]]
---
  def create
    auction = Auction.new auction_params
    auction.save

SELECT "auctions".* FROM "auctions"
---
  def index
    auction = Auction.all

SELECT  "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def show
    auction = Auction.find params[:id]

SELECT  "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "auctions" WHERE "auctions"."id" = $1  [["id", 1]]
---
  def destroy
    auction = Auction.find params[:id]
    auction.destroy